'''
Группа 21ИС-21
Старцев Илья
14.11.2022
Задача №1:
Дано целое число. Если оно является положительным, то вычесть из него 8; в противном случае не изменять его. Вывести полученное число. 
'''
a = int(input())
if a > 0:
	a = a - 8
print(a)
